// Question:=>  What is the difference between var, let, and const in JavaScript?

//"var, let, এবং const এর মূল পার্থক্য হলো এদের স্কোপ (Scope), রিঅ্যাসাইনমেন্ট  ক্ষমতা এবং হোইস্টিং ba আচরণের মধ্যে। var হলো ওল্ড বা লিগ্যাসি জাভাস্ক্রিপ্টের নিয়ম, আর let এবং const এসেছে ES6 (Modern JS) সংস্করণে কোডের বাগ বা ভুল কমানোর জন্য।"

//Scope (স্কোপ): "var হলো Function-scoped। অর্থাৎ এটি ব্লকের (if বা for লুপের) বাইরেও লিক বা অ্যাক্সেস হয়ে যায়। কিন্তু let এবং const হলো Block-scoped; এরা যে কার্লি ব্রেস {} এর ভেতর থাকে, তার বাইরে এদের অ্যাক্সেস করা যায় না।

// "Reassignment (মান পরিবর্তন): "var এবং let এর মান পরবর্তীতে পরিবর্তন (Reassign) করা যায়। কিন্তু const দিয়ে ডিক্লেয়ার করা কোনো ভ্যারিয়েবলের মান পরিবর্তন করা যায় না, এটি ফিক্সড বা ধ্রুবক থাকে।"

//"বাস্তব কাজের ক্ষেত্রে (Best Practice হিসেবে), আমি ডিফল্টভাবে সবসময় const ব্যবহার করি। যদি কোনো ভ্যারিয়েবলের মান পরবর্তীতে পরিবর্তনের প্রয়োজন হয় (যেমন লুপের কাউন্টার), তখন let ব্যবহার করি। আর কোডে বাগ বা জটিলতা এড়াতে এখন var এর ব্যবহার সম্পূর্ণ এড়িয়ে চলি।"