const question ="Explain the concept of hoisting in JavaScript?"

const answer ={
    starting:"Hoisting হলো জাভাস্ক্রিপ্টের এমন একটি আচরণ (Behavior), যেখানে কোড রান বা এক্সিকিউট হওয়ার আগেই, সব ভ্যারিয়েবল এবং ফাংশন ডিক্লেয়ারেশনগুলোকে (Declarations) তাদের স্কোপের একদম উপরে নিয়ে যাওয়া হয়।",

    backend:"জাভাস্ক্রিপ্ট ইঞ্জিন কোড রান করার সময় মূলত দুটি ফেজে (Phase) কাজ করে:১. প্রথম ফেজে (Compilation Phase) এটি পুরো কোড স্ক্যান করে সব ভ্যারিয়েবল এবং ফাংশন ডিক্লেয়ারেশনকে মেমরিতে জায়গা দেয়।২. দ্বিতীয় ফেজে (Execution Phase) কোড লাইন-বাই-লайн রান করে।যেহেতু মেমরি অ্যালোকেশন আগেই হয়ে যায়, তাই আমাদের কাছে মনে হয় ডিক্লেয়ারেশনগুলো উপরে উঠে বা Hoist হয়ে গেছে।"
}